
REGION_COURSES_MAP = {
    '인천광역시': ['DMZ 평화의 길 1코스', '서해랑길 94코스', '서해랑길 95코스', '서해랑길 96코스', '서해랑길 97코스', '서해랑길 98코스', '서해랑길 99코스', '서해랑길 100코스', '서해랑길 101코스', '서해랑길 102코스', '서해랑길 103코스'],
    '김포시': ['DMZ 평화의 길 1코스', 'DMZ 평화의 길 2코스', 'DMZ 평화의 길 3코스', 'DMZ 평화의 길 4코스', '서해랑길 94코스', '서해랑길 95코스', '서해랑길 96코스', '서해랑길 97코스', '서해랑길 98코스', '서해랑길 99코스'],
    '고양시': ['DMZ 평화의 길 4코스', 'DMZ 평화의 길 5코스'],
    '파주시': ['DMZ 평화의 길 5코스', 'DMZ 평화의 길 6코스', 'DMZ 평화의 길 7코스', 'DMZ 평화의 길 8코스', 'DMZ 평화의 길 9코스', 'DMZ 평화의 길 10코스'],
    '연천군': ['DMZ 평화의 길 11코스', 'DMZ 평화의 길 12코스', 'DMZ 평화의 길 13코스', 'DMZ 평화의 길 14코스'],
    '철원군': ['DMZ 평화의 길 14코스', 'DMZ 평화의 길 15코스', 'DMZ 평화의 길 16코스', 'DMZ 평화의 길 17코스', 'DMZ 평화의 길 18코스'],
    '화천군': ['DMZ 평화의 길 19코스', 'DMZ 평화의 길 20코스', 'DMZ 평화의 길 21코스', 'DMZ 평화의 길 22코스', 'DMZ 평화의 길 23코스'],
    '양구군': ['DMZ 평화의 길 24코스', 'DMZ 평화의 길 25코스', 'DMZ 평화의 길 26코스', 'DMZ 평화의 길 27코스', 'DMZ 평화의 길 28코스', 'DMZ 평화의 길 29코스'],
    '인제군': ['DMZ 평화의 길 30코스'],
    '고성시': ['DMZ 평화의 길 31코스', 'DMZ 평화의 길 32코스', 'DMZ 평화의 길 33코스', 'DMZ 평화의 길 34코스', '해파랑길 46코스', '해파랑길 47코스', '해파랑길 48코스', '해파랑길 49코스', '해파랑길 50코스'],
    '부산광역시': ['해파랑길 1코스', '해파랑길 2코스', '해파랑길 3코스', '해파랑길 4코스', '남파랑길 1코스', '남파랑길 2코스', '남파랑길 3코스', '남파랑길 4코스', '남파랑길 5코스'],
    '울산광역시': ['해파랑길 5코스', '해파랑길 6코스', '해파랑길 7코스', '해파랑길 8코스', '해파랑길 9코스'],
    '경주시': ['해파랑길 10코스', '해파랑길 11코스', '해파랑길 12코스'],
    '포항시': ['해파랑길 13코스', '해파랑길 14코스', '해파랑길 15코스', '해파랑길 16코스', '해파랑길 17코스', '해파랑길 18코스'],
    '영덕군': ['해파랑길 19코스', '해파랑길 20코스', '해파랑길 21코스', '해파랑길 22코스'],
    '울진군': ['해파랑길 23코스', '해파랑길 24코스', '해파랑길 25코스', '해파랑길 26코스', '해파랑길 27코스'],
    '삼척시': ['해파랑길 28코스', '해파랑길 29코스', '해파랑길 30코스', '해파랑길 31코스', '해파랑길 32코스', '해파랑길 33코스', '해파랑길 34코스'],
    '강릉시': ['해파랑길 35코스', '해파랑길 36코스', '해파랑길 37코스', '해파랑길 38코스', '해파랑길 39코스', '해파랑길 40코스'],
    '양양시': ['해파랑길 41코스', '해파랑길 42코스', '해파랑길 43코스', '해파랑길 44코스', '해파랑길 45코스'],
    '창원시': ['남파랑길 6코스', '남파랑길 7코스', '남파랑길 8코스', '남파랑길 9코스', '남파랑길 10코스', '남파랑길 11코스'],
    '통영시': ['남파랑길 12코스', '남파랑길 13코스', '남파랑길 14코스', '남파랑길 15코스', '남파랑길 28코스', '남파랑길 29코스', '남파랑길 30코스', '남파랑길 31코스', '남파랑길 32코스', '남파랑길 33코스'],
    '거제시': ['남파랑길 16코스', '남파랑길 17코스', '남파랑길 18코스', '남파랑길 19코스', '남파랑길 20코스', '남파랑길 21코스', '남파랑길 22코스', '남파랑길 23코스', '남파랑길 24코스', '남파랑길 25코스', '남파랑길 26코스', '남파랑길 27코스'],
    '사천시': ['남파랑길 34코스', '남파랑길 35코스', '남파랑길 36코스', '남파랑길 37코스'],
    '남해군': ['남파랑길 34코스', '남파랑길 35코스', '남파랑길 36코스', '남파랑길 37코스'],
    '하동군': ['남파랑길 34코스', '남파랑길 35코스', '남파랑길 36코스', '남파랑길 37코스'],
    '여수시': ['남파랑길 52코스', '남파랑길 53코스', '남파랑길 54코스', '남파랑길 55코스', '남파랑길 56코스', '남파랑길 57코스', '남파랑길 58코스', '남파랑길 59코스', '남파랑길 60코스'],
    '보성군': ['남파랑길 63코스', '남파랑길 64코스', '남파랑길 65코스', '남파랑길 66코스', '남파랑길 67코스', '남파랑길 68코스', '남파랑길 69코스', '남파랑길 70코스', '남파랑길 71코스', '남파랑길 72코스', '남파랑길 73코스', '남파랑길 74코스', '남파랑길 75코스', '남파랑길 76코스', '남파랑길 77코스'],
    '장흥군': ['남파랑길 78코스', '남파랑길 79코스', '남파랑길 80코스', '남파랑길 81코스', '남파랑길 82코스', '남파랑길 83코스', '남파랑길 84코스'],
    '완도군': ['남파랑길 85코스', '남파랑길 86코스', '남파랑길 87코스', '남파랑길 88코스', '남파랑길 89코스', '남파랑길 90코스'],
    '고흥군': ['남파랑길 63코스', '남파랑길 64코스', '남파랑길 65코스', '남파랑길 66코스', '남파랑길 67코스', '남파랑길 68코스', '남파랑길 69코스', '남파랑길 70코스', '남파랑길 71코스', '남파랑길 72코스', '남파랑길 73코스', '남파랑길 74코스', '남파랑길 75코스', '남파랑길 76코스', '남파랑길 77코스'],
    '강진군': ['남파랑길 78코스', '남파랑길 79코스', '남파랑길 80코스', '남파랑길 81코스', '남파랑길 82코스', '남파랑길 83코스', '남파랑길 84코스'],
    '해남군': ['남파랑길 85코스', '남파랑길 86코스', '남파랑길 87코스', '남파랑길 88코스', '남파랑길 89코스', '남파랑길 90코스', '서해랑길 1코스', '서해랑길 2코스', '서해랑길 3코스', '서해랑길 4코스', '서해랑길 5코스', '서해랑길 13코스', '서해랑길 14코스', '서해랑길 15코스', '서해랑길 16코스'],
    '진도군': ['서해랑길 6코스', '서해랑길 7코스', '서해랑길 8코스', '서해랑길 9코스', '서해랑길 10코스', '서해랑길 11코스', '서해랑길 12코스'],
    '영암군': ['서해랑길 17코스', '서해랑길 18코스'],
    '목포시': ['서해랑길 17코스', '서해랑길 18코스'],
    '무안군': ['서해랑길 19코스', '서해랑길 20코스', '서해랑길 21코스', '서해랑길 22코스', '서해랑길 23코스', '서해랑길 24코스', '서해랑길 25코스', '서해랑길 31코스', '서해랑길 32코스', '서해랑길 33코스', '서해랑길 34코스'],
    '함평군': ['서해랑길 35코스', '서해랑길 36코스', '서해랑길 37코스', '서해랑길 38코스', '서해랑길 39코스', '서해랑길 40코스'],
    '영광군': ['서해랑길 35코스', '서해랑길 36코스', '서해랑길 37코스', '서해랑길 38코스', '서해랑길 39코스', '서해랑길 40코스'],
    '신안군': ['서해랑길 26코스', '서해랑길 27코스', '서해랑길 28코스', '서해랑길 29코스', '서해랑길 30코스'],
    '고창군': ['서해랑길 41코스', '서해랑길 42코스', '서해랑길 43코스', '서해랑길 44코스'],
    '부안군': ['서해랑길 45코스', '서해랑길 46코스', '서해랑길 47코스', '서해랑길 48코스', '서해랑길 49코스', '서해랑길 50코스'],
    '김제시': ['서해랑길 51코스', '서해랑길 52코스'],
    '군산시': ['서해랑길 53코스', '서해랑길 54코스', '서해랑길 55코스'],
    '서천군': ['서해랑길 56코스', '서해랑길 57코스', '서해랑길 58코스'],
    '보령시': ['서해랑길 59코스', '서해랑길 60코스', '서해랑길 61코스', '서해랑길 62코스', '서해랑길 63코스'],
    '홍성군': ['서해랑길 59코스', '서해랑길 60코스', '서해랑길 61코스', '서해랑길 62코스', '서해랑길 63코스'],
    '태안군': ['서해랑길 64코스', '서해랑길 65코스', '서해랑길 66코스', '서해랑길 67코스', '서해랑길 68코스', '서해랑길 69코스', '서해랑길 70코스', '서해랑길 71코스', '서해랑길 72코스', '서해랑길 73코스', '서해랑길 74코스', '서해랑길 75코스'],
    '서산시': ['서해랑길 76코스', '서해랑길 77코스', '서해랑길 78코스', '서해랑길 79코스', '서해랑길 80코스', '서해랑길 81코스', '서해랑길 82코스', '서해랑길 83코스'],
    '당진시': ['서해랑길 76코스', '서해랑길 77코스', '서해랑길 78코스', '서해랑길 79코스', '서해랑길 80코스', '서해랑길 81코스', '서해랑길 82코스', '서해랑길 83코스'],
    '아산시': ['서해랑길 84코스', '서해랑길 85코스', '서해랑길 86코스', '서해랑길 87코스', '서해랑길 88코스'],
    '평택시': ['서해랑길 84코스', '서해랑길 85코스', '서해랑길 86코스', '서해랑길 87코스', '서해랑길 88코스'],
    '화성시': ['서해랑길 84코스', '서해랑길 85코스', '서해랑길 86코스', '서해랑길 87코스', '서해랑길 88코스'],
    '안산시': ['서해랑길 89코스', '서해랑길 90코스', '서해랑길 91코스', '서해랑길 92코스', '서해랑길 93코스'],
    '시흥시': ['서해랑길 89코스', '서해랑길 90코스', '서해랑길 91코스', '서해랑길 92코스', '서해랑길 93코스'],
}

import requests
import os
from dotenv import load_dotenv

# .env 파일 로드
load_dotenv()

TOUR_URL = "http://apis.data.go.kr/B551011/Durunubi"


# API 기본 설정
class TourAPI:
    def __init__(self):
        self.base_url = TOUR_URL
        self.params = {
            "serviceKey": os.getenv("DURUNUBI_TOUR_SERVICE_KEY"),
            "numOfRows": 5,
            "pageNo": 1,
            "_type": "json",
            "MobileOS": "IOS",
            "MobileApp": "chattravel",
        }

    def get(self, endpoint):
        response = requests.get(f"{self.base_url}{endpoint}", params=self.params)
        response.raise_for_status()  
        return response.json()

tour_api = TourAPI()

# 코스 목록 정보 조회
def get_course_list(siDo):
    try:
        courses = REGION_COURSES_MAP[siDo]
        result = []

        for course in courses:
            tour_api.params['crsKorNm'] = course
            data = tour_api.get("/courseList")
            result.append(data["response"]["body"]["items"]["item"])
            
        return result
    except Exception as e:
        raise RuntimeError("Failed to fetch courseList") from e

if __name__ == "__main__":
    # 실행 테스트
    try:
        course_list = get_course_list('인천광역시')
        for course in course_list:
            print(course)
        
    except RuntimeError as e:
        print(e)

